Tools/src/Catalogs/ОИМЦ_63_ИсточникиФинансирования/ОИМЦ_63_ИсточникиФинансирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОИМЦ_63_ИсточникиФинансирования</name>
  <owners>Catalog.ОИМЦ_63_Организации</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОИМЦ_63_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникФинансирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БюджетИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tools/src/Catalogs/ОИМЦ_63_ИсточникиФинансирования/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтотОбъект.Список.Отбор.Элементы.Количество() = 0 Тогда
		Элементы.Заполнить.Видимость = Ложь;
		Элементы.ОтборОрганизация.Видимость = Истина;
	Иначе
		Элементы.Заполнить.Видимость = Истина;
		Элементы.ОтборОрганизация.Видимость = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ТЗ = ОИМЦ_Данные.ЗапросДанных63("select distinct m.""budgetID"", coalesce(d.description, 'Отделение') as descript " + 
									"from ""movementDrug"".movement m left join documents.doc d on d.id = m.""budgetID"" " +
									"where ""orgID"" = " + Формат(ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.ОргИд, "ЧГ=0") + 
									" order by descript;");
	Если ТЗ <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для каждого Элемент Из ТЗ Цикл
			Наименование = СокрЛП(Элемент.descript);
			Поиск = Справочники.ОИМЦ_63_ИсточникиФинансирования.НайтиПоНаименованию(Наименование, Истина, , ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка);
			Если Поиск.Пустая() Тогда
				НО = Справочники.ОИМЦ_63_ИсточникиФинансирования.СоздатьЭлемент();				
				НО.Наименование = Наименование;
				НО.Владелец = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка;
				НО.Организация = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка;
				НО.ИсточникФинансирования = Наименование;
				НО.БюджетИд = Элемент.budgetID;			
				НО.Записать();	
			Иначе
				СО = Поиск.ПолучитьОбъект();							
				СО.ИсточникФинансирования = Наименование;
				СО.БюджетИд = Элемент.budgetID;			
				СО.Записать();	
			КонецЕсли; 			
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Организация,,, ЗначениеЗаполнено(Организация));
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
